name: "pix2struct"
backend: "python"
input [
  {
    name: "image"
    data_type: TYPE_UINT8  
    dims: [-1, -1, 3]
  }
]
output [
  {
    name: "caption"
    data_type: TYPE_STRING  
    dims: [-1]
  }
]
